//=======================================================================================
//! @file   QRText
//! @brief  テキストを読み込んだ値によって変更
//! @author 志水大輔
//! @date   10/9
//! @note   まだまだ書き加えます
//=======================================================================================
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;

public class QRText : MonoBehaviour
{
    // QRで読み込んだ値によって中身のText変更する
    [SerializeField]
    private Text qRText;


    //=======================================================================================
    //! @brief ゲーム以外のQRコードを読み込んだ時のText  0
    //! @param[in] なし
    //! @param[out] なし
    //! @return なし
    //=======================================================================================
    public void NOQR()
    {
        // テキストの変更
        qRText.text = "正規のQRコードではありません";
    }

    //=======================================================================================
    //! @brief 時間が増えるときのText  1
    //! @param[in] なし
    //! @param[out] なし
    //! @return なし
    //=======================================================================================
    public void IncreaseTime()
    {
        // テキストの変更
        qRText.text = "制限時間が増えました";
    }

    //=======================================================================================
    //! @brief カバーを付けた時のText　DefenseUP  2
    //! @param[in] なし
    //! @param[out] なし
    //! @return なし
    //=======================================================================================
    public void DefenseUp()
    {
        // テキストの変更
        qRText.text = "消しゴムにカバーをつけました";
    }

    //=======================================================================================
    //! @brief 残機が増えた時のText  4
    //! @param[in] なし
    //! @param[out] なし
    //! @return なし
    //=======================================================================================
    public void RemainingUp()
    {
        // テキストの変更
        qRText.text = "残機が「1」増えました";
    }

    //=======================================================================================
    //! @brief プレイヤーの変更Text (消しゴム)  8
    //! @param[in] なし
    //! @param[out] なし
    //! @return なし
    //=======================================================================================
    public void PlayerEraser()
    {
        // テキストの変更
        qRText.text = "プレイヤーが消しゴムに変更されました";
    }

    //=======================================================================================
    //! @brief プレイヤーの変更Text (鉄) 16
    //! @param[in] なし
    //! @param[out] なし
    //! @return なし
    //=======================================================================================
    public void PlayerIron()
    {
        // テキストの変更
        qRText.text = "プレイヤーが鉄に変更されました";
    }

}
